[
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Independent Medical Education Request for Proposals Improving Shared Decision Making in Hemophilia: Visiting Professorship Program Summary of Opportunity Overview",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-09/2025%20RD%20US%20HTRS%20Hemophilia%20Visiting%20Professorship%20IME.pdf"
  },
  {
    "posted": "September 15, 2025",
    "deadline": "October 16, 2025",
    "snippet": "Request for Proposals Improving Actionable Biomarker Testing Through Technology-Enabled Solutions Competitive Grant Program – Quality Improvement Projects Geographic Scope/Location of Project: United States",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-09/2025-ONC-US-CCF-ASCO-QI-TechnologySolutionsBiomarkerTesting.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Independent Medical Education Grant Request for Proposals Competitive Grant Program – Pfizer Internal Review Process USP <797> Pharmaceutical Compounding- Sterile Preparations: Challenges and Special",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-09/2025-I%26I-US-USP-797SterilePreparations-KG.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Independent Medical Education Grant Request for Proposals Competitive Grant Program – Pfizer Internal Review Process Collaborative Community Oncology Support for Therapy Management in Relapsed/Refractory",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-08/2025-ONC-G-CommunitySupportRRMM-IDM-IME.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Education in the Era of Emerging Hemophilia Therapy (Round 2) Independent Medical Education Grant Request for Proposals Introduction: Pfizer and the National Bleeding Disorders Foundation are collaborating to offer another grant opportunity seeking proposals for independent medical education initiatives that will provide:",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-09/2025-RD-US-NBDF-HemophiliaEducation-IME.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Independent Medical Education Grant Request for Proposals Competitive Grant Program – Pfizer Internal Review Process New Mechanisms and Emerging Treatment Options in Metastatic Castration Resistant",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-09/2025-ONC-G-CommunitySupportRRMM-IDM-IME.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Independent Medical Education Grant Request for Proposals Competitive Grant Program – using Internal Review Panel Unmet Needs and Emerging Data in Patients with High-Risk Non-Muscle Invasive Bladder Cancer (NMIBC)",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-08/2025%20NMIBC_Sasanlimab_RFP%20IME_FINAL%2029Jul2025.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Independent Medical Education Grant Request for Proposals Competitive Grant Program – Pfizer Internal Review Process Emerging Data and Unmet Needs in Patients with High- Risk Non-Muscle Invasive Bladder Cancer (NMIBC)",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-08/2025_Global_IME_NMIBC_UnmetNeeds_Final_082525.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Quality Improvement Grant Request for Proposals Enhancing Patient-Centered Outcomes in Emergency Department Migraine Management Overview Pfizer and the American College of Emergency Physicians (ACEP) are collaborating to offer a new grant opportunity",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-08/2025%20IM%20US%20ACEP%20Migraine%20QI.pdf"
  },
  {
    "posted": "August 13, 2025",
    "deadline": "n/a",
    "snippet": "Independent Medical Education Request for Proposals (RFP) Maintenance Therapy in HER2+ Metastatic Breast Cancer (MBC) Competitive Grant Program – Pfizer Internal Review Process Date RFP Issued: August 13, 2025",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-08/2025_US_HER2pos_mBC_RFP_IME_Final_0813.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Request for Proposals (RFP) Antimicrobial Stewardship in the Sub-Saharan African Region Introduction Antimicrobial Resistance (AMR) poses a critical and escalating public health threat in Africa, disproportionately affecting sub-Saharan Africa (SSA). In the most recent published estimates",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-08/2025-I%26I-Sub-Saharan-Africa-AntimicrobialStewardship-QI.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Independent Medical Education Grant Request for Proposals (RFP) Competitive Grant Program Actionable Biomarker and Genetic Testing in Cancer: Education for Advanced Practice",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-08/2025_RFP_Biomarkers_PanTumor_education_APPs_0.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Independent Medical Education Grant Request for Proposals Competitive Grant Program – using Expert Review Panel Unmet Needs and Emerging Data in Patients with High-Risk Non-Muscle Invasive Bladder Cancer (NMIBC)",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-07/2025-ONC-US-NMIBC-UnmetNeeds-IME.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "September 16, 2025",
    "snippet": "Pfizer Independent Medical Education Grant Request for Proposals Competitive Grant Program – Pfizer Internal Review Process Interdisciplinary Collaboration for the Management of Severe Alopecia Areata in",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-08/2025-I%26I-US-AlopeciaAreata-KG.pdf"
  },
  {
    "posted": "June 26, 2025",
    "deadline": "n/a",
    "snippet": "Independent Medical Education Request for Proposals (RFP) PARP-Inhibitor Combination Treatments: Biomarker Testing, Safety, and Efficacy in a Rapidly Changing Metastatic Prostate Cancer (mPC) Landscape Competitive Grant Program – Pfizer Internal Review Process",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-06/2025-ONC-US-PARPi-mCRPC-IME.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Research Grant Request for Proposals Competitive Grant Program – Pfizer Internal Review Process Pediatric pneumococcal carriage and serotype distribution surveillance: prospective studies in South-East Asia, 2025-",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-07/2025-VAC-SoutheastAsiaPedPneumococcal-RES.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Independent Medical Education Grant Request for Proposals Competitive Grant Program – Pfizer Internal Review Process Advancing Health Care Professionals’ knowledge and understanding of adult and maternal vaccination against",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-07/2025%20VAV%20Int%20Immunization%20Practice%20Gaps%20IME%20updated%20version.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Research Grant Request for Proposals Review and analysis of serotype distribution and burden of pneumococcal disease in children younger than 5 years – Post vaccination era Competitive Grant Program –Pfizer Internal Review Process",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-07/2025-VAC-ACCORD-serotypedistributionburdenpneumococcaldisease-RES.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Research Grant Request for Proposals The Clinical Application of ATM-AVI in Patients with CRE Infections, including MBL-Producing CRE Competitive Grant Program –Pfizer Internal Review Process",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-07/2025-HOS-CN-ATMAVI-CRE-RES.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Independent Medical Education Grant Request for Proposals Competitive Grant Program – Pfizer Internal Review Process COVID-19 Disease Burden on the High Risk Population Overview",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-07/2025-VAC-G-COVID-19BurdenonHighRiskPopulation-KG.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Research Grant Request for Proposals New Research Areas to Improve Diagnosis and Treatment of Inflammatory Bowel Disease Overview: Pfizer Inc. and the American Gastroenterological Association (AGA) are collaborating to offer a new grant opportunity to",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-07/2025-I%26I-US-AGA-IBD-DiagnosisTreatment-RES_1.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer and Conquer Cancer, the ASCO Foundation Quality Improvement Request for Proposals Optimizing the Experience of Patients with Bladder Cancer Through Multi-Disciplinary Care",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-05/2025%20ONC%20US%20CCF%20Bladder%20Cancer%20QI.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Quality Improvement Grant Request for Proposals The Enhancement of Management of breast cancer in French speaking Sub-Saharan African Countries Overview Pfizer and the L'Association Marocaine de Recherche et de Formation en Oncologie Médicale (AMFROM) are",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-05/GMG-2025-ONC-SSA-AMFROMBreastCancer-QI-EN.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Demande de subvention pour amélioration de la qualité L’amélioration de la prise en charge du cancer du sein chez Pays francophones d’Afrique subsaharienne Présentation Pfizer et l’Association Marocaine de Recherche et de Formation en Oncologie Médicale (AMFROM) collaborent à",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-05/GMG-2025-ONC-SSA-AMFROMBreastCancer-QI-FR.pdf"
  },
  {
    "posted": "May 28, 2025",
    "deadline": "n/a",
    "snippet": "Independent Medical Education Request for Proposals (RFP) Clinical Updates and Strategies in the Treatment and Management of First-line BRAF V600E-mutant Metastatic Colorectal Cancer (mCRC) and Metastatic Non- Small Cell Lung Cancer (mNSCLC)",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-05/2025%20US%20BRAF%201L%20mCRC-mNSCLC%20IME%20RFP%20-%20Final_27May2025.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Request For Proposals Guidelines and Best Practices in the Holistic Management of Patients with Metastatic Urothelial Carcinoma (mUC) Date of Release: May 29, 2025 I. Background",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-05/GMG-2025-ONC-mUCBestPractices.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Quality Improvement Grant Request for Proposals Improving Atopic Dermatitis and Alopecia Areata Quality of Care to Standardize Management Overview Pfizer and the Beijing Guangda Precision Medicine Research Center are collaborating to offer a new grant",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-05/GMG-2025-I%26I-CN-ImprovingADAAQualityCareStandardizeManagement.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Independent Medical Education Grant Request for Proposals Competitive Grant Program – Pfizer Internal Review Process Post-COVID Conditions: Potential Diagnosis, Testing, Management, and Ongoing Research",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-05/GMG-2025-VAC-US-Post-COVIDConditions-KG.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Quality Improvement Request for Proposals Competitive Grant Program – using Expert Review Panel Optimizing Antimicrobial Stewardship Program in Saudi Arabia",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-06/ER%26G-2025-I%26I-Saudi-Arabia-AntimicrobialStewardship-QI.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Research Grant Request for Proposals Competitive Grant Program – Pfizer Internal Review Process Real-World Data Generation with Elranatamab in Relapsed/Refractory Multiple Myeloma Overview",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-06/2025%20Research%20Multiple%20Myeloma%20Global.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Quality Improvement Request for Proposals Competitive Grant Program – using Pfizer Internal Review Process Shared Decision Making in Hemophilia Patient Care Overview",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-06/ER%26G-2025-RD-US-SDMHemophilia-QI.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Independent Research Grant Request for Proposals Competitive Grant Program – Pfizer Internal Review Process Invasive Mold Infections (IMI) - Real-World Evidence from Treatment Outcomes with Isavuconazole",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-06/ER%26G-2025-I%26I-G-InvasiveMoldInfectionsRealWorldEvidence-RES.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Quality Improvement Request for Proposals Competitive Grant Program – using Pfizer Internal Review Process Optimizing maternal immunization practice in Malaysia Indonesia Singapore Philippines",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/2025-06/ER%26G-2025-VAC-MISPMaternalImmunization-QI.pdf"
  },
  {
    "posted": "4",
    "deadline": "n/a",
    "snippet": "Pfizer Medical Education Group Request for Proposals (RFP) Pneumococcal Disease Prevention I. Background The mission of the Pfizer Medical Education Group is to accelerate the adoption of evidence-",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/rfp_pdp.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Medical Education Group Request for Proposals (RFP): Pneumococcal Disease Prevention External Review Panel Maureen Doyle-Scharff, MBA, Ph.D. (ABD) Affiliation: Pfizer, Inc., Medical Education Group",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/erp_summary_pdp.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Medical Education Group Request for Proposals (RFP) Chronic Pain: Assessing the Impact of Diagnostic Tools I. Background The mission of the Pfizer Medical Education Group is to accelerate the adoption of evidence-",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/rfp_chronic_pain.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Independent Grants for Learning and Change Request for Proposals (RFP): Chronic Pain: Assessing the Impact of Diagnostic Tools Full Proposal Review Meeting Objective: The External Review Panel (ERP) convened to discuss and determine Full Proposal decisions.",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/rfp_files/Full%20Proposal%20Review%20Summary%20-%20Chronic%20Pain%20Assessing%20the%20Impact%20of%20Diagnostic%20Tools.pdf"
  },
  {
    "posted": "6",
    "deadline": "n/a",
    "snippet": "Pfizer Medical Education Group Request for Proposals (RFP) Bacterial Infections I. Background The mission of the Pfizer Medical Education Group is to accelerate the adoption of evidence-",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/rfp_bacterial_infections.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Medical Education Group Request for Proposals (RFP): Bacterial Infections External Review Panel Maureen Doyle-Scharff, MBA, Ph.D. (ABD) Affiliation: Pfizer, Inc., Medical Education Group",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/erp_bacterial_infections.pdf"
  },
  {
    "posted": "6",
    "deadline": "n/a",
    "snippet": "Pfizer Medical Education Group Request for Proposals (RFP) Pneumococcal Disease Prevention I. Background The mission of the Pfizer Medical Education Group is to accelerate the adoption of evidence-",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/rfp_pneumococcal_disease_prevention.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Medical Education Group Request for Proposals (RFP): Pharmacy Pneumococcal Disease Prevention External Review Panel Maureen Doyle-Scharff, MBA, Ph.D. (ABD) Affiliation: Pfizer, Inc., Medical Education Group",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/erp_pharmacy_pdp.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Smoking Cessation Leadership Center at UCSF and Pfizer Medical Education Group Request for Proposals (RFP) July 2, 2012 I. Background",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/rfp_smoking_cessation.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Independent Grants for Learning and Change Request for Proposals (RFP): Smoking Cessation Full Proposal Review Meeting Objective: The External Review Panel (ERP) convened to discuss and determine Full Proposal decisions.",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/rfp_files/Full%20Proposal%20Review%20Summary%20-%20Smoking%20Cessation_0.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Medical Education Group Request for Proposals (RFP) – Non‐Small Cell Lung Cancer (NSCLC) Release Date: Tuesday, July 10, 2012 I. Background “Lung cancer is the leading cause of cancer‐related mortality, accounting for ~1.4 million",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/rfp_lung_cancer.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Medical Education Group Request for Proposals (RFP): Non‐Small Cell Lung Cancer (NSCLC) External Review Panel Robert L. Addleton, Ed.D., LPC, FACEHP, CCMEP Affiliation: Physicians’ Institute for Excellence in Medicine",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/erp_lung_cancer.pdf"
  },
  {
    "posted": "7",
    "deadline": "n/a",
    "snippet": "Pfizer Medical Education Group Request for Proposals (RFP) Cardiovascular Risk in Rheumatoid Arthritis: Assessing the Impact of Screening I. Background",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/rfp_cv_risk_ra.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Medical Education Group Request for Proposals (RFP): Cardiovascular Risk in Rheumatoid Arthritis External Review Panel Maureen Doyle-Scharff, MBA, Ph.D. (ABD)",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/erp_cv_risk_ra.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Medical Education Group Request for Proposals (RFP) The Role for Appropriate Opioid Medication Use as Part of a Comprehensive Pain Management Approach I. Background",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/rfp_opioid_pain.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Medical Education Group Request for Proposals (RFP): Opioid Pain External Review Panel Jeroan Allison, M.D. Affiliation: University of Massachusetts Medical School",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/erp_opioid_pain.pdf"
  },
  {
    "posted": "8",
    "deadline": "n/a",
    "snippet": "Pfizer Medical Education Group Request for Proposals (RFP) Adult Pneumococcal Disease Prevention Economic and Coordination Barriers I. Background",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/rfp_adult_pdp.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/erp_adult_pdp.pdf"
  },
  {
    "posted": "9",
    "deadline": "n/a",
    "snippet": "Pfizer Medical Education Group Request for Proposals (RFP) Prevention of Stroke in Women I. Background The mission of the Pfizer Medical Education Group is to accelerate the adoption of evidence-",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/rfp_women_stroke.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Medical Education Group Request for Proposals (RFP): Prevention of Stroke in Women External Review Panel Roster Maureen Doyle-Scharff, MBA, Ph.D. (ABD) Affiliation: Pfizer, Inc., Medical Education Group",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/erp_women_stroke.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Medical Education Group Request for Proposals – Educational Needs Assessments ONLY Clinical Area #1: Renal Cell Carcinoma (RCC) Clinical Area #2: Hematologic Malignancies, specifically: Leukemia (CML and ALL) and Non-Hodgkin’s",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/rfp_oncology_needs_assessments.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Medical Education Group Request for Proposals (RFP): Oncology Needs Assessment External Review Panel Roster Robert L. Addleton, Ed.D., LPC, FACEHP, CCMEP Affiliation: Physicians’ Institute for Excellence in Medicine",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/erp_oncology_needs_assessments.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "MEG Extension Application Procedure for Continuation and/or Expansion of an Existing Grant-supported Initiative Where Additional Funding is Requested This procedure is modeled after the NIH procedure for completing a supplemental application. A new grant application (an extension application) may be submitted to request support for a",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/rfp_extension_grant.pdf"
  },
  {
    "posted": "n/a",
    "deadline": "n/a",
    "snippet": "Pfizer Independent Grants for Learning and Change Request for Proposals: Extension Grants Full Proposal Review Meeting Objective: The Advisory Board convened to discuss and determine Full Proposal decisions. Meeting Date: Monday, June 17, 2013",
    "portal": "pfizer_gmg",
    "source": "https://cdn.pfizer.com/pfizercom/responsibility/grants_contributions/Full_Proposal_extension_grant.pdf"
  }
]